tutorials/compressible/sonicFoam/ras/nacaAirfoil/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    INLE1
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

    OUTL2
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

    SYMP3
    {
        type            empty;
    }

    WALL10
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
